'''จำได้หรือไม่เมื่อโปรแกรมของบทเรียนตอนที่แล้ว ? แต่เมื่อคุณครูวิชาวิทยาศาสตร์ แขนงวิชา ฟิสิกส์นิวเคลียร์
ฝ่ายมัธยมต้นใช้โปรแกรมดังกล่าว แล้วดันกรอกข้อมูลผิดเข้าไปในระบบจาก 100 เป็น 1000 ซึ่งโปรแกรมดังกล่าวก็ยังทำงานได้อยู่ ทั้งๆที่โรงเรียนได้บอกไว้แล้วว่าคะแนนจะอยู่ในช่วง
0 - 100 เท่านั้น ดังนั้นแล้วให้เราทำการแก้ไขโปรแกรมข้อดังกล่าวให้กรอกได้แค่ 0 - 100 เท่านั้นก่อนนำไปคำนวณผลเพื่อตัดเกรด
โดยถ้าเกิดกรอกถูกต้องจะแสดงข้อมูลเช่นในข้อที่ 10 เหมือนเดิม แต่ถ้าเกิดกรอกต่ำกว่าหรือเกิน ให้แจ้งว่าไม่สามารถกรอกได้ดังตัวอย่าง'''

score = int(input())
if score > 100 or score < 0:
    print("Error : Value must be less than or equal to 100.")
else:
    if score >= 90:
        print("A")
    elif 85 <= score <= 89:
        print("B+")
    elif 80 <= score <= 84:
        print("B")
    elif 75 <= score <= 79:
        print("C+")
    elif 70 <= score <= 74:
        print("C")
    elif 65 <= score <= 69:
        print("D+")
    elif 60 <= score <= 64:
        print("D")
    elif score < 60:
        print("F")
